{
    "Fall 2019 @ RBC" : {
        "Introduction" : "Learning is one of the most interesting and complex activities we take part in. To pretend to know a topic is easy but to truly learn something is very difficult. That is because the dual parts of it, the awareness and the experience, must support each other. To be aware of a topic from reading a textbook or listening to a lecture is a valuable starting point, but quickly fades without experience to back it up. To have experience without awareness of its meaning can lead to important points being missed. I consider my part four months at RBC to have been extremely valuable because in backing up my awareness of topics with experience, I was able to learn important topics that I had wanted to for a long time. This includes technology, but really one of the most important lessons I learned is that the start and end of any technical job is not that. In addition to coding, it is important to know how to work with a variety of people and cultures. My hope, through this report, is to include my experience in all aspects of my term and hopefully some valuable lessons learned therefrom.",
        "About The Company" : "RBC is one of the most well-known and valuable brands in Canada and a very large company, with personal banking being only one part of the bank’s operations. In additional to the branches that the reader would be familiar with, RBC has several areas including insurance, commercial banking, capital markets and a variety of ventures aimed at making clients’ lives easier, from applications that help with home renovations and paying rent, to those aimed at helping individuals start small businesses. In order to provide these services, the bank needs an extremely reliable and high-performance IT infrastructure, which is the area of the business that I worked with the most. One of the most interesting aspects of working in IT at RBC is that a great variety of technologies are used in the company, even if some are more widely used than others. For example, in addition to the servers that I worked on, the bank also uses IBM mainframes as well as x86 servers and a variety of programming languages. This is an excellent learning opportunity for students, because just like spoken languages, operating systems and programming languages also encompass different ways of approaching problems and seeing these solutions can help us be aware of the options that exist.",
        "Goals-Header" : "In this term, I took a slightly different approach to setting and evaluating goals: I focused on the goals that I thought I needed the most improvement on, and those which I thought would help the most when it came to my own personal development. While this is a slightly different approach to my previous strategy, and certainly more challenging, I also think it is more effective when it comes to evaluating and improving my performance. I set three major goals for this Co-op term:",
        "Goal-1" : "To develop a good knowledge of the team, the technologies that we work with, the systems we help keep running as well as the requirements and responsibilities of my position.",
        "Goal-2" : "To take more initiative and participate in the innovation challenge, which involves writing software to solve real business problems at the company.",
        "Goal-3" : "To learn to ask for help earlier and when I need it. I believe it would be best for my learning if I tried to solve every problem on my own first, asking for help if I get stuck.",
        "Goals-Footer" : "Overall, I am quite happy with my experience relating to these goals, not because I achieved any of them perfectly but because I believe they helped push me in the right direction. I am very happy with my progress in terms of the technologies I worked with and while I am by no means an expert now, I did feel much more able to confident to accomplish tasks at the end of the term. While my group did not achieve a very high result in the innovation challenge, I am still proud of my enthusiasm and my contribution to the effort, which was a functional and highly performant server. I believe the area where I saw the most advancement was in my ability to ask for help and clarification when needed. I remember there was one concept that I needed to understand to improve a backup script, which had to be explained three times before I fully understood it. Even though it was a challenge at first, I am now really happy that I asked for that clarification because without it, I would not have same level of understanding that I have now, and I would not have been able to develop as good a script as I had.",
        "Job Description" : "As part of a support team, my job mostly consisted of writing and updating scripts and programs to automate tasks on our servers, and to help keep them running smoothly. This included scripts to help keep track of backups and restart any backups when needed, scripts to update user profiles and to generate reports. While these may not sound like extremely complex tasks, they did require a good knowledge of logic and operating systems, which I was happy to use. The programming languages and technologies used made writing these scripts very interesting, as they are written differently than on a windows server, for example, where we would not be using the message system and spooler nearly as much.",
        "Relation To Acedemic Studies" : "Over the course of this work term, I found that the most useful piece of knowledge I had from university was my knowledge of operating systems from second year. Since the operating systems that I worked on did not have the same abstractions as newer operating systems, having this knowledge really helped me understand what was going on. At the same time, I found many things to be different from what I learned in university. I found that there are many factors that play a part in the creation of a solution and that the techniques and solutions that are taught in university are not always optimal in an actual work environment. I think this is related to the fact that many courses only cover topics in isolation, when in practice they would be applied in integrated environments.",
        "Conclusions" : "I find that I have grown a lot, both personally and professionally over the course of this work term. Working with a variety of languages and servers has really opened my eyes to new ways of programming and achieving solutions. I am also very happy with my progress on the goals that I set. At the same time, I also learned about my own working style and needs. In the future, I would like to take a slightly different approach to the Co-op process. I would like to try working not only in a variety of industries but also at a variety of types of cultures. While many students only want to learn technical skills from Co-op, I now believe the most valuable part of the program is in learning to work in a variety of environments and with a variety of people.",
        "Acknowledgments" : "I would really like to thank my manager Grant Lowe, for teaching me about the NonStop servers, giving me a chance to show my knowledge though interesting tasks, and generally being an amazing manager. I would not have been able to succeed without his help!"
    }
}